levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_tmrb.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TMRB_Global_Functions
 * @{
 */

/**
 * @brief  Set the TimerB counter value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Value Counter value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
__STATIC_INLINE void TMRB_SetCounter(M4_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    WRITE_REG16(TMRBx->CNTER, u16Value);
}

/**
 * @brief  Get the TimerB counter value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Counter value (between Min_Data=0 and Max_Data=0xFFFF)
 */
__STATIC_INLINE uint16_t TMRB_GetCounter(const M4_TMRB_TypeDef *TMRBx)
{
    return READ_REG16(TMRBx->CNTER);
}

/**
 * @brief  Set TimerB period register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Value Period value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
__STATIC_INLINE void TMRB_SetPeriod(M4_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    WRITE_REG16(TMRBx->PERAR, u16Value);
}

/**
 * @brief  Get TimerB period register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Period value (between Min_Data=0 and Max_Data=0xFFFF)
 */
__STATIC_INLINE uint16_t TMRB_GetPeriod(const M4_TMRB_TypeDef *TMRBx)
{
    return READ_REG16(TMRBx->PERAR);
}

/**
 * @brief  Start TimerB.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval None
 */
__STATIC_INLINE void TMRB_Start(M4_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_START);
}

/**
 * @brief  Stop TimerB.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval None
 */
__STATIC_INLINE void TMRB_Stop(M4_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_START);
}

/* Initialization and configuration TimerB base functions */
en_result_t TMRB_Init(M4_TMRB_TypeDef *TMRBx,
                            const stc_tmrb_init_t *pstcInit);
en_result_t TMRB_StructInit(stc_tmrb_init_t *pstcInit);
en_result_t TMRB_DeInit(M4_TMRB_TypeDef *TMRBx);
void TMRB_SetCntDirection(M4_TMRB_TypeDef *TMRBx, uint16_t u16Direction);
uint16_t TMRB_GetCntDirection(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetCntMode(M4_TMRB_TypeDef *TMRBx, uint16_t u16Mode);
uint16_t TMRB_GetCntMode(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetClkDiv(M4_TMRB_TypeDef *TMRBx, uint16_t u16Div);
uint16_t TMRB_GetClkDiv(const M4_TMRB_TypeDef *TMRBx);
en_flag_status_t TMRB_GetFlag(const M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag);
void TMRB_ClearFlag(M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag);
void TMRB_IntCmd(M4_TMRB_TypeDef *TMRBx,
                        uint16_t u16IntSource,
                        en_functional_state_t enNewState);
void TMRB_EventCmd(M4_TMRB_TypeDef *TMRBx,
                            uint32_t u32EvtSource,
                            en_functional_state_t enNewState);
en_result_t TMRB_SetTriggerSrc(const M4_TMRB_TypeDef *TMRBx,
                                    en_event_src_t enEventSrc);
void TMRB_SetHwTriggerCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
void TMRB_SetHwStartCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TMRB_GetHwStartCondition(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetHwStopCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TMRB_GetHwStopCondition(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetHwClearCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TMRB_GetHwClearCondition(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetHwUpCondition(M4_TMRB_TypeDef *TMRBx,
                                    uint16_t u16Condition);
uint16_t TMRB_GetHwUpCondition(const M4_TMRB_TypeDef *TMRBx);
void TMRB_SetHwDownCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TMRB_GetHwDownCondition(const M4_TMRB_TypeDef *TMRBx);
 void TMRB_SetTriangleWaveBufMode(M4_TMRB_TypeDef *TMRBx,
                                    uint32_t u32Ch,
                                    uint16_t u16Mode);
void TMRB_SetCompare(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32Ch,
                                uint16_t u16Value);
uint16_t TMRB_GetCompare(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch);
void TMRB_BufCmd(M4_TMRB_TypeDef *TMRBx,
                        uint32_t u32BufCh,
                        en_functional_state_t enNewState);

/* Initialization and configuration TimerB input capture functions */
en_result_t TMRB_IC_Init(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32PwmCh,
                                const stc_tmrb_ic_init_t *pstcIcInit);
en_result_t TMRB_IC_StructInit(stc_tmrb_ic_init_t *pstcIcInit);
en_result_t TMRB_IC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32PwmCh);
void TMRB_IC_SetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32PwmCh,
                                            uint16_t u16Condition);
uint16_t TMRB_IC_GetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32PwmCh);
void TMRB_IC_SetFilterClkDiv(M4_TMRB_TypeDef *TMRBx, 
                                            uint32_t u32PwmCh,
                                            uint16_t u16Div);
uint16_t TMRB_IC_GetFilterClkDiv(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh);
void TMRB_IC_EnableNoiseFilter(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh);
void TMRB_IC_DisableNoiseFilter(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh);

