levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/inc/hc32m423_tmrb.h
/* Initialization and configuration TimerB output compare functions */
en_result_t TMRB_OC_Init(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32PwmCh,
                                const stc_tmrb_oc_init_t *pstcOcInit);
en_result_t TMRB_OC_StructInit(stc_tmrb_oc_init_t *pstcOcInit);
en_result_t TMRB_OC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32PwmCh);
void TMRB_OC_EnablePortOutput(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_DisablePortOutput(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_SetStartCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity);
uint16_t TMRB_OC_GetStartCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_SetStopCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity);
uint16_t TMRB_OC_GetStopCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_SetCmpMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity);
uint16_t TMRB_OC_GetCmpMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_SetPeriodMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                        uint32_t u32PwmCh,
                                                        uint16_t u16Polarity);
uint16_t TMRB_OC_GetPeriodMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);
void TMRB_OC_SetForceOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity);
uint16_t TMRB_OC_GetForceOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh);

/**
 * @}
 */

#endif /* DDL_TMRB_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_TMRB_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
